
1 = GeoNetwork doit \u00EAtre arr\u00EAt\u00E9 en vue d'effectuer cette op\u00E9ration

10 = Configuration de la base de donn\u00E9es

11 = Cet assistant permet de changer la base de donn\u00E9es utilis\u00E9es par GeoNetwork. Pour changer la configuration ou cr\u00E9er le sch\u00E9ma de la base de donn\u00E9es, aller dans 'base de donn\u00E9es/cr\u00E9ation'. Si vous s\u00E9lectionnez la base de donn\u00E9es embarqu\u00E9e et que les fichiers de donn\u00E9es ne sont pas l\u00E0\u00A0 (par exemple parce que vous venez de r\u00E9cup\u00E9rer le code \u00E0\u00A0 partir du d\u00E9p\u00F4t Subversion), le bouton 'Enregistrer' va les cr\u00E9er et g\u00E9n\u00E9rer un nouveau compte utilisateur.

12 = Gestion

13 = Importation

14 = Importation de m\u00E9tadonn\u00E9es

15 = Cet assistant permet de r\u00E9importer un export de m\u00E9tadonn\u00E9es au format MEF. Les nouveaux jeux de m\u00E9tadonn\u00E9es seront cr\u00E9\u00E9s. Donc, assurez-vous d'avoir une base de donn\u00E9es vide si vous ne voulez pas avoir des doublons de m\u00E9tadonn\u00E9es.

16 = Utilisations MEF : GeoNetwork doivt \u00EAtre en cours d'ex\u00E9cution.

17 = Exportation

18 = Exportation de m\u00E9tadonn\u00E9es

19 = Cet assistant permet d'exporter les m\u00E9tadonn\u00E9es et donn\u00E9es de GeoNetwork dans un dossier de votre syst\u00E8me de fichiers. L'export cr\u00E9e un fichier pour chaque m\u00E9tadonn\u00E9es au format MEF.

2 = GeoNetwork doit \u00EAtre red\u00E9marr\u00E9 afin d'appliquer les changements

20 = M\u00E9tadonn\u00E9es Sync

21 = Synchronisation des m\u00E9tadonn\u00E9es

22 = Chaque m\u00E9tadonn\u00E9e contient des liens vers GeoNetwork afin de permettre la r\u00E9cup\u00E9ration des ressources. Si vous changez l'adresse du serveur et le port de l'interface web, ces liens se brisent. Cet assistant analyse toutes les m\u00E9tadonn\u00E9es et corrige ces liens.

23 = Synchroniser

24 = Tous les jeux de m\u00E9tadonn\u00E9es doivent \u00EAtre scann\u00E9s et modifi\u00E9s. Aucune \u00E9dition ne doit \u00EAtre en cours.

25 = 115 \u00E0\u00A0 139

26 = Conversion ISO19115 \u00E0\u00A0 ISO19139

27 = Avant la version 2.1, GeoNetwork g\u00E9re uniquement le mod\u00E8le ISO19115. A partir de la version 2.1, il est possible d'utiliser la norme ISO 19139 qui correspond \u00E0\u00A0 l'encodage XML de la norme ISO 19115:2003. Cet assistant permet la conversion des m\u00E9tadonn\u00E9es ISO19115 en ISO19139.

28 = Convertir

29 = GeoNetwork pourrait m\u00EAme \u00EAtre en cours d'ex\u00E9cution, mais il est peut-\u00EAtre mieux si elle est arr\u00EAt\u00E9e.

3 = GeoNetwork doit \u00EAtre en cours d'ex\u00E9cution afin d'ex\u00E9cuter cette op\u00E9ration

30 = Base de donn\u00E9es

31 = Cr\u00E9ation

32 = Cr\u00E9ation de la base de donn\u00E9es

33 = Une fois que la base de donn\u00E9es est configur\u00E9e dans 'configuration/DBMS ',cet assistant permet la cr\u00E9ation du mod\u00E8le de donn\u00E9es et ins\u00E9rer les donn\u00E9es initiales.

34 = GeoNetwork ne doit pas \u00EAtre en cours d'ex\u00E9cution lors de la cr\u00E9ation de la base de donn\u00E9es.

35 = Exemple

36 = Donn\u00E9es et m\u00E9tadonn\u00E9es exemple

37 = Des exemples de m\u00E9tadonn\u00E9es peuvent \u00EAtre import\u00E9s dans GeoNetwork apr\u00E8s installation. Ces exemples sont fournis seulement afin d'exp\u00E9rimenter les caract\u00E9ristiques de l'interface utilisateur. Il est \u00E9galement possible d'importer les m\u00E9tadonn\u00E9es \u00E0\u00A0plusieurs reprises afin de remplir une base de donn\u00E9es pour des tests de stress.

38 = Pour l'utilisation des imports/exports MEF, GeoNetwork doit \u00EAtre en cours d'ex\u00E9cution.

39 = Migrations

4 = Configuration

40 = Ancienne installation

41 = Migrer une ancienne version

42 = cet assistant permet de migrer les m\u00E9tadonn\u00E9es de GeoNetwork version 2.0.x. Cette proc\u00E9dure migre la base de donn\u00E9es. Apr\u00E8s ce stade, vous aurez probablement besoin de configurer certains param\u00E8tres dans le fichier config.xml (e.g. datadir). D'autres param\u00E8tres (e.g. proxy) doivent \u00EAtre chang\u00E9s en utilisant l'interface web dans administration / configuration du syst\u00E8me. Les m\u00E9tadonn\u00E9es moissonn\u00E9es ne sont pas migr\u00E9es. Lors de la migration, les noeuds source et destination NE DOIVENT PAS \u00EAtre d\u00E9marr\u00E9s. Sous Tomcat, les r\u00E9pertoires 'web' doivent \u00EAtre s\u00E9lectionn\u00E9s.

43 = Migration

44 = GeoNetwork doit \u00EAtre arr\u00EAt\u00E9 lorsque la base de donn\u00E9es est en cours de migration.

45 = GeoNetwork doit \u00EAtre red\u00E9marr\u00E9 afin d'appliquer les changements.

46 = Pour l'utilisation des imports/exports MEF, GeoNetwork doit \u00EAtre en cours d'ex\u00E9cution.

47 = Ancien G\u00E9oSource

48 = Migrer une ancienne version de G\u00E9oSource 

49 = cet assistant permet de migrer les m\u00E9tadonn\u00E9es de G\u00E9oSource version 1.x Cette proc\u00E9dure migre la base de donn\u00E9es. Apr\u00E8s ce stade, vous aurez probablement besoin de configurer certains param\u00E8tres dans le fichier config.xml (e.g. datadir). D'autres param\u00E8tres (e.g. proxy) doivent \u00EAtre chang\u00E9s en utilisant l'interface web dans administration / configuration du syst\u00E8me. Les m\u00E9tadonn\u00E9es moissonn\u00E9es ne sont pas migr\u00E9es. Lors de la migration, les noeuds source et destination NE DOIVENT PAS \u00EAtre d\u00E9marr\u00E9s. Sous Tomcat, les r\u00E9pertoires 'web' doivent \u00EAtre s\u00E9lectionn\u00E9s.

5 = Param\u00E8tre Jetty

50 = *** Attention *** Cette section permet le changement de l'identifiant du noeud local. Cette action ne doit pas \u00EAtre r\u00E9alis\u00E9e manuellement.

51 = Identifiant du site

52 = Changement de l'identifiant du site\u0009\u0009\u0009\u0009

6 = Si vous utilisez GeoNetwork avec le serveur int\u00E9gr\u00E9 Jetty alors vous pouvez utiliser cet assistant pour modifier certains param\u00E8tres (i.e. nom du servlet, port HTTP utilis\u00E9 pour acc\u00E9der \u00E0 GeoNetwork).

7 = Enregistrer

8 = Jetty doit \u00EAtre red\u00E9marr\u00E9 afin d'appliquer les changements.

9 = Base de donn\u00E9es
